import React from "react";
import { Fragment } from "react";
import Header from "../components/header/header";
import CheckList from "../components/checkList/checkList"
import styles from "./index.module.css";

export default function Home() {

  return (
    <Fragment>
      <div class="page-background"></div>
      <div className="page-container">
        <div className="page-content">
          <Header/>

          <h1>Курсова работа по ОУП</h1>
          <p className={styles.subtitle}>Прототип на дизайн за система за управление на знанията</p>
          <p>
            <em>Автор: Костадин Динков</em><br />
            <em>Студентски №: 46355з </em>
          </p>
          <hr></hr>
          <h2>Цел на Уеб Проекта</h2>
          <p>
            Този уеб проект си поставя за цел две основни задачи.
            Първата е да покрие изискванията на курсовата работа по Основи на Уеб Програмирането
            - дисциплина, която се изучава в първи семестър като част от обучението в направление
            Информатика и Компютърни науки в УниБит. Втората задаче е да бъде разработен прототип на дизайн (UI + UX) за 
            уеб базирана ситема за управление на знанията (LMS).<br/>
            Кодът на тази курсова работа може да бъде разгледан 
            в това <a href="https://github.com/KostaDinkov/kiberlab-lms-gatsby">Github репозитори</a> 
          </p>

          <h2>Използвани Технологии</h2>
          <p>
            За реализирането на този проект е използван Gatsby - генератор за статични сайтове използващ React.
            React е web технология базирана на Javascript и разработена от Facebook, която ни позволява динамично да създаваме
            потребителски интерфейси като комбинираме Javascript и HTML чрез синтаксис наречен JSX. Компонентите написани с 
            React могат да постигат високо ниво на абстракция и по-този начин лесно да бъдат преизползвани в различни контексти
            и с променливи данни. Макар че React e front-end-framework, т.е. изпълнява се на клиентския браузър и генерира 
            целия HTML в реално време (runtime), Gatsby ни дава възможност да пишем компоненти и уеб страници използвайки
            синтаксиса на React и след това да генерираме статични ресурси (HTML, CSS, Javascript), които да могат да бъдат
            хоствани статично и съответно връщани от http сървър като отговори на Http заяавки.
          </p>

          <h2>LMS</h2>
          <p>
            Системата за управление на знанията, за която се разработва потребителският интерфейс демонстриран с този проект
            има за цел да улесни създаването на онлайн базирани учебни материали и курсове. Потребителите на системата ще 
            могат да се регистрират, да се записват за курсове, да разглеждат съдържанието на курсовете, да решават тестове,
            гледат видеа, както и да печелят точки и постижения (badges, achievements) при постигането на определени цели. Администраторите
            на системата ще могат лесно да създават курсове и съдържание, и да получават статискики свързани с прогреса на потребителите.
            Системата е в ранен стадий на разработка (към 23.11.2020), а сървърната технологията, която е използвана е ASP.NET core.
            Дизайнът от този сайт ще бъте пренаписан чрез синтаксисът Razor, който се използва в ASP.NET core и както React, служи
            за описване на UI, чрез комбиниране на Javascript и C#. Кодът за бекенда може да бъде разгледан в 
            репозиторито <a href="https://github.com/KostaDinkov/kiberlab-lms-aspnetcore">тук</a>
          </p>

          <h2>Курсова работа</h2>
          <p>
            Подробна информация за изпълнението на изискванията по курсовата работа може да бъде намерена в 
            раздел <a href="/Courses/">/Courses</a>.<br/>
            На текущата страница са използвани следните html/css функционалности:
          </p>
          <CheckList>
            <span>Заглавия</span>
            <span>Параграфи</span>
          </CheckList>
          Кодът на текущата страница може се намира в папка <code>src/pages/index.js</code>. 

        </div>

      </div>
    </Fragment>
  )
}


